Classes | Public Types | Public Member Functions | Friends | List of all members
ACAPI::MEP::SystemBrowserCalculationCallbackInterface Class Referenceabstract
MEP Element Manager
Interface for handling calculated columns in the system browser. More...
#include <MEPSystemBrowserCalculationCallbackInterface.hpp>
 Classes
struct  | ColumnRowEntry
The signature of the entries in the result data. The row is decided by the system browser, so the entry is identified using the associated element id instead. More...
 Public Types
 using  | CalculationResultData = std::vector<ColumnRowEntry>
The signature of the result data.
 Public Member Functions
virtual std::vector< const ICalculationResultColumn * >  | RegisterCalculatedColumns ()=0
Register columns that is managed by this interface.
virtual void  | CalculationsRequested (const GS::Guid &rootElement, const DistributionSystemsGraph &system)=0
Function invoked every time the system browser detects that a system affecting some registered calculated columns was modified.
void  | SubmitCalculations (const CalculationResultData &results) const
Informs the system browser of modifications to the registered columns. Use this to to respond to a calculation request from the system browser.
 Friends
Result< void >  | RegisterCalculationCallback (SystemBrowserCalculationCallbackInterface &callbackInterface)
Registers a custom callback interface implementation.
Detailed Description
Interface for handling calculated columns in the system browser.
You can implement this interface in your add-on to provide custom columns in the system browser that gets calculated on demand. This interface does two things:
It registers additional columns that should be displayed in the system browser.
It provides a system for updating the (registered) column values when system attributes change.
This communication between the browser and the add-on works both ways: The system browser will notify any registered SystemBrowserCalculationCallbackInterface instances that it's registered columns might need recalculation, and the add-on can inform the system browser to update it's displayed values for the registered columns.
Since
Archicad 29
class TestCalculationCallback : public ACAPI::MEP::SystemBrowserCalculationCallbackInterface {
 public:
 TestColumn1 testColumn;
 TestCalculationCallback () = default;
 // ! [SystemBrowserCalculationCallbackInterface_RegisterCalculatedColumns_Example]
 virtual std::vector<const ACAPI::MEP::ICalculationResultColumn*> RegisterCalculatedColumns () override
 {
 return { &testColumn };
 }
 // ! [SystemBrowserCalculationCallbackInterface_RegisterCalculatedColumns_Example]
 // ! [SystemBrowserCalculationCallbackInterface_CalculationsRequested_Example]
 virtual void CalculationsRequested (const GS::Guid& root, const ACAPI::MEP::DistributionSystemsGraph& graph) override
 {
 Reporter reporter;
 reporter.Add (GS::UniString::Printf ("Calculation callback was called on root element %T!", root.ToUniString ().ToPrintf ()));
 reporter.AddNewLine ();
 reporter.Add (GS::UniString::Printf ("In a graph with %zu systems!", graph.GetSystems ().size ()));
 reporter.AddNewLine ();
 reporter.Write ();
 }
 // ! [SystemBrowserCalculationCallbackInterface_CalculationsRequested_Example]
 virtual ~TestCalculationCallback () = default;
 };
See also
ACAPI::MEP::RegisterCalculationCallback
Remarks
This interface replaces the ACAPI::MEP::GraphCalculationInterface interface from Archicad 28. The new interface supports the same functionality as the old one, but using a friendlier syntax. Here's a small guide on how to transition your old implementation to this new interface:
// Using ACAPI::MEP::GraphCalculationInterface:
std::shared_ptr<void> registrationInstance;
class MyCoolColumn : public ACAPI::MEP::TypedCalculationResultColumn<GS::UniString>
{
 ...
};
void CallbackHandlerFunction (const GS::Guid& root, const ACAPI::MEP::DistributionSystemsGraph& graph)
{
 // Some code being executed when a calculation is requested from the browser...
 ...
 // Inform browser of changes to the columns:
 ACAPI::Result<ACAPI::MEP::GraphCalculationInterface> calculationInterface = ACAPI::MEP::CreateCalculationInterface ();
 calculationInterface->InvokeCalculationResults (changes);
}
void RegisterCalculationCallback ()
{
 ACAPI::Result<ACAPI::MEP::GraphCalculationInterface> calculationInterface = ACAPI::MEP::CreateCalculationInterface ();
 MyCoolColumn myCoolColumn;
 std::vector<const ACAPI::MEP::ICalculationResultColumn*> columnsToShowInBrowser;
 columnsToShowInBrowser.emplace_back (&myCoolColumn);
 ACAPI::Result<std::shared_ptr<void>> registrationResult = calculationInterface->RegisterDoCalculationCallback (&CallbackHandlerFunction, columnsToShowInBrowser);
 registrationInstance = registrationResult.Unwrap ();
}
// Using ACAPI::MEP::SystemBrowserCalculationCallbackInterface:
std::shared_ptr<void> registrationInstance;
class MyCoolColumn : public ACAPI::MEP::TypedCalculationResultColumn<GS::UniString>
{
 ...
};
class MyCalculationCallback : public ACAPI::MEP::SystemBrowserCalculationCallbackInterface
{
public:
 MyCoolColumn myCoolColumn;
 virtual std::vector<const ACAPI::MEP::ICalculationResultColumn*> RegisterCalculatedColumns () override
 {
 return { &myCoolColumn };
 }
 virtual void CalculationsRequested (const GS::Guid& root, const ACAPI::MEP::DistributionSystemsGraph& graph) override
 {
 // Some code being executed when a calculation is requested from the browser...
 ...
 // Inform browser of changes to the columns:
 SubmitCalculations (changes);
 }
};
MyCalculationCallback registrationInstance;
void RegisterCalculationCallback ()
{
 ACAPI::MEP::RegisterCalculationCallback (registrationInstance);
}
Member Function Documentation
◆ CalculationsRequested()
 virtual void ACAPI::MEP::SystemBrowserCalculationCallbackInterface::CalculationsRequested  |  ( |  const GS::Guid & |  rootElement,
|  const DistributionSystemsGraph & |  system )
pure virtual
Function invoked every time the system browser detects that a system affecting some registered calculated columns was modified.
The system browser will invoke this function whenever a system related parameter changes that could affect the calculated values. Examples when this occours include, but is not limited to, when elements are added or removed from the system and when element dimensions or certain element specific or system specific parameters are changed. The system browser is also free to skip invoking this function if the modified system is not covered by the registered columns. When calculations are finished, add-ons can choose to respond to this request by invoking SystemBrowserCalculationCallbackInterface::SubmitCalculations to update the displayed values in the system browser.
Remarks
This function is invoked from the system browser based on model changes empirically determined to affect the calculated values. But as the displayed values are implementation defined, the detected changes may not always actually affect the displayed values. Therefore there's no requirement to "respond" to SubmitCalculations after receiving a CalculationsRequested call. Similarly, an add-on is free to invoke SubmitCalculations at any time, regardless of whether a CalculationsRequested call has been received.
Parameters
rootElement | The "root" element of the system that has been modified.
system | The distribution systems graph that contains the modified system.
 virtual void CalculationsRequested (const GS::Guid& root, const ACAPI::MEP::DistributionSystemsGraph& graph) override
 {
 Reporter reporter;
 reporter.Add (GS::UniString::Printf ("Calculation callback was called on root element %T!", root.ToUniString ().ToPrintf ()));
 reporter.AddNewLine ();
 reporter.Add (GS::UniString::Printf ("In a graph with %zu systems!", graph.GetSystems ().size ()));
 reporter.AddNewLine ();
 reporter.Write ();
 }
◆ RegisterCalculatedColumns()
 virtual std::vector< const ICalculationResultColumn * > ACAPI::MEP::SystemBrowserCalculationCallbackInterface::RegisterCalculatedColumns  |  ( |   | )
pure virtual
Register columns that is managed by this interface.
The system browser will invoke this once on initialization. The columns are unregistered when this interface instance goes out of scope and it's destructor is called. Deleting the memory pointed to by the pointers returned from this function before the interface goes out of scope leads to undefined behavior.
Returns
A vector of pointers to the columns that this interface will manage.
 virtual std::vector<const ACAPI::MEP::ICalculationResultColumn*> RegisterCalculatedColumns () override
 {
 return { &testColumn };
 }
◆ SubmitCalculations()
 void ACAPI::MEP::SystemBrowserCalculationCallbackInterface::SubmitCalculations  |  ( |  const CalculationResultData & |  results | ) |   const
Informs the system browser of modifications to the registered columns. Use this to to respond to a calculation request from the system browser.
Parameters
results | A vector of column-row entries representing the results of the calculation.
 ACAPI::MEP::SystemBrowserCalculationCallbackInterface::CalculationResultData changedElements;
 // Generate some random values to display in the system browser:
 auto genRandomNum = [gen = std::default_random_engine {}, dist = std::uniform_real_distribution<> { 0.1, 100.0 }] () mutable
 {
 return dist (gen);
 };
 for (const ACAPI::MEP::UniqueID& element : graphElements) {
 changedElements.emplace_back (ACAPI::MEP::SystemBrowserCalculationCallbackInterface::ColumnRowEntry { element.GetGuid (), testCallback.testColumn.GetId (), genRandomNum () });
 }
 testCallback.SubmitCalculations (changedElements);
Friends And Related Symbol Documentation
◆ RegisterCalculationCallback
 Result< void > RegisterCalculationCallback  |  ( |  SystemBrowserCalculationCallbackInterface & |  callbackInterface | )
friend
Registers a custom callback interface implementation.
Parameters
callbackInterface | The custom callback interface implementation to register.
Returns
Error if registration failed, otherwise nothing.
Since
Archicad 29
 TestCalculationCallback testCallback;
 ACAPI::Result<void> result = ACAPI::MEP::RegisterCalculationCallback (testCallback);
 if (result.IsErr ())
 return result.UnwrapErr ().kind;